/*
 *  Настроить проект, вывести в консоль “Hello world!”.
 *  Вывести в консоль системные дату и время.
 *
 */

package Java_GB.Seminar.Seminar_1.classWork;

import java.time.LocalDateTime;

public class task_0 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
        System.out.println(LocalDateTime.now());

    }
}
