package ru.medwedSA.Java_Core_GB.Seminars.Seminar_1.ClassWork;

/*
 *  Настроить проект, вывести в консоль “Hello world!”.
 *  Вывести в консоль системные дату и время.
 *
 */

import java.time.LocalDateTime;

public class task_0 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
        System.out.println(LocalDateTime.now());

    }
}
